[{ "title":"Code Style", "url":"/2015/07/10/code-style.html", "excerpt":"For Java code, we will follow Google's code style guidelines. Please read up on the [guidelines](http://google.github.io/styleguide/javaguide.html). The only rule we change is the indentation. Instead of an indentation of 2, we use 4 spaces to indent the next level.\n\n" },{ "title":"Software Development Infrastructure", "url":"/2015/07/10/infrastructure.html", "excerpt":"In the Digital Innovation Group, we follow Continous Integration principles as much as possible. We are still in the process of setting up the infrastructure, but ideally all projects will use the following components.\n\n" },{ "title":"GitHub Workflow", "url":"/2015/07/10/gitflow.html", "excerpt":"A few DigInG projects are hosted at SourceForge and use Subversion as version control system. However, most projects are hosted on GitHub and you will most likely interact with GitHub and Git in your projects. We will use the \"Gitflow Workflow\" described in this [article](https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow). Please read it carefully, you will be expected to follow the described procedure. The most important points for you are:\n\n" },{ "title":"Scrum", "url":"/2015/07/13/scrum-structure.html", "excerpt":"In DigInG we follow an agile methodology, specifically Scrum. You will work in small teams, which each has:\n\n" },{ "title":"GitHub Account", "url":"/2015/07/14/github.html", "excerpt":"Most of our projects are hosted on GitHub. In the beginning of the class you will learn how to use Git and GitHub. You will therefore need an account on GitHub. Please create your account by registering [here](https://github.com/join). Choose the free plan and don't create an organization. We will add you to the DigInG organization, once you start working on our projects.\n\n\n" },{ "title":"Issue Tracking", "url":"/2015/07/15/jira-pivotaltracker.html", "excerpt":"We use several different issue tracking systems for our projects. Depending on what project you are working on, you will need an account in [Jira](https://diging.atlassian.net/) and/or [Pivotaltracker](http://www.pivotaltracker.com/). Once you have created an account let us know what your username is and we will add you to our projects.\n\n\n" },{ "title":"Python Code Cleanliness - PEP8", "url":"/2015/08/19/python-code-style.html", "excerpt":"For Python projects, we will follow the [PEP8 Style Guide for Python Code](https://www.python.org/dev/peps/pep-0008/).\n\n" },{ "title":"Intro to Git", "url":"/2015/08/19/into-to-git.html", "excerpt":"[Git](https://git-scm.com/) is a [Version Control System](https://en.wikipedia.org/wiki/Revision_control) that is widely used in software development projects. A VCS helps developers keep track of changes to source code over the course of a project. We use Git for all kinds of projects, not just for managing source code. A solid working knowledge of Git is essential for both researchers and developers in DigInG.\n\n" },{ "title":"Testing in Python Projects", "url":"/2015/08/19/testing-in-python.html", "excerpt":"All of our Python projects should include a comprehensive array of tests. For unit tests, we use the built-in Python [unittest](https://docs.python.org/2/library/unittest.html) framework.\n\n" }]
